jimmywong2003/nrf5-packet-error-rate-measurement-on-ble-connection/ble_app_image_transfer/main.c
#ifdef NRF52840_XXAA
#define TX_POWER_LEVEL (8) /**< TX Power Level value. This will be set both in the TX Power service, in the advertising data, and also used to set the radio transmit power. */
#else
#define TX_POWER_LEVEL (4) /**< TX Power Level value. This will be set both in the TX Power service, in the advertising data, and also used to set the radio transmit power. */
#endif

#define UART_TX_BUF_SIZE 256 /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE 256 /**< UART RX buffer size. */

#define DEAD_BEEF 0xDEADBEEF /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define CONNECTION_ONE_SECOND_INTERVAL APP_TIMER_TICKS(1000) /**< Battery level measurement interval (ticks). */

APP_TIMER_DEF(m_connection_one_sec_timer_id);

BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT); /**< BLE NUS service instance. */
BLE_ITS_DEF(m_its, NRF_SDH_BLE_TOTAL_LINK_COUNT); /**< BLE IMAGE TRANSFER service instance. */
BLE_LBS_DEF(m_lbs);                               /**< LED Button Service instance. */

NRF_BLE_GATT_DEF(m_gatt); /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);   /**< Context for the Queued Write module.*/

APP_TIMER_DEF(m_restart_advertising_timer_id);

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID; /**< Handle of the current connection. */

static uint8_t m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;           /**< Advertising handle used to identify an advertising set. */
static uint8_t m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];            /**< Buffer for storing an encoded advertising set. */
static uint8_t m_enc_scan_response_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX]; /**< Buffer for storing an encoded scan data. */

static uint16_t m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3; /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */

static ble_its_ble_params_info_t m_ble_params_info = {20, 50, 1, 1};
static uint16_t m_ble_its_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3; /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */

app_display_content_t m_application_state = {0};

static uint8_t m_new_command_received = 0;
static uint8_t m_new_resolution, m_new_phy;
static bool m_stream_mode_active = false;

static void display_update(void);
static void advertising_start(void);

static uint8_t img_data_buffer[BLE_ITS_MAX_DATA_LEN];
static uint8_t m_buffer_transfer_index = 0;

static uint32_t frameCount = 0;
static uint32_t frameCount_previous = 0;
static uint32_t img_data_length = BLE_ITS_MAX_DATA_LEN;

#define TEST_FIRMWARE_SIZE (4 * 1024 * 1024)

static uint32_t start_time = 0;
static uint32_t finish_time = 0;
static uint32_t data_send = 0;

//static bool test_flag = false;
static bool start_thoughput_test = false;

#define GPIO_SEND_COUNT_PIN 31

/**@brief Struct that contains pointers to the encoded advertising data. */
static ble_gap_adv_data_t m_adv_data =
{
        .adv_data =
        {
                .p_data = m_enc_advdata,
                .len = BLE_GAP_ADV_SET_DATA_SIZE_MAX
        },
        .scan_rsp_data =
        {
                .p_data = m_enc_scan_response_data,
                .len = BLE_GAP_ADV_SET_DATA_SIZE_MAX

        }
};

static void test_thoughput(void)
{
        uint32_t ret_code;
        do
        {
                memset(img_data_buffer, m_buffer_transfer_index, m_ble_its_max_data_len);
                ret_code = ble_its_send_file_fragment(&m_its, img_data_buffer, m_ble_its_max_data_len);
                if (ret_code == NRF_SUCCESS)
                {
                        img_data_length = 0;
                        frameCount++;
                        nrf_gpio_pin_toggle(GPIO_SEND_COUNT_PIN);
                        data_send += m_ble_its_max_data_len;
                }
                m_buffer_transfer_index++;
                m_buffer_transfer_index = m_buffer_transfer_index % 10;

                if (data_send > TEST_FIRMWARE_SIZE)
                {
                        finish_time = app_timer_cnt_get();
                        start_thoughput_test = false;
                        //NRF_LOG_INFO("Total time = %d.", (finish_time - start_time)/32768);

                        uint32_t time_ms = (finish_time - start_time) * 1000 / 32768;
                        uint32_t bit_count = (data_send * 8);
                        float throughput_kbps = ((bit_count / (time_ms / 1000.f)) / 1000.f);

                        NRF_LOG_INFO("Done.");
                        NRF_LOG_INFO("=============================");
                        NRF_LOG_INFO("Time: %u.%.2u seconds elapsed.", (time_ms / 1000), (time_ms % 1000));
                        NRF_LOG_INFO("Throughput: " NRF_LOG_FLOAT_MARKER " Kbps.",
                                     NRF_LOG_FLOAT(throughput_kbps));
                        NRF_LOG_INFO("=============================");
                        NRF_LOG_INFO("Sent %u bytes of ATT payload.", data_send);
                        NRF_LOG_INFO("Retrieving amount of bytes received from peer...");

                        app_timer_stop(m_connection_one_sec_timer_id);
                        break;
                }
        } while (ret_code == NRF_SUCCESS);
}

static void connection_one_second_timeout_handler(void *p_context)
{
        UNUSED_PARAMETER(p_context);

        uint32_t throughput_kbps = ((frameCount - frameCount_previous) * m_ble_its_max_data_len * 8);

        NRF_LOG_INFO("%d, %d, %06d bits, %02d %%", frameCount, frameCount - frameCount_previous, throughput_kbps, data_send * 100 / TEST_FIRMWARE_SIZE);
        frameCount_previous = frameCount;
        m_application_state.throughput_kbps = throughput_kbps / 1000;

        display_update();
}

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name)
{
        app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for the LEDs initialization.
 *
 * @details Initializes all LEDs used by the application.
 */
static void leds_init(void)
{
        bsp_board_init(BSP_INIT_LEDS);
}

static void restart_advertising_callback(void *p)
{
        advertising_start();
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
        // Initialize timer module, making it use the scheduler
        ret_code_t err_code = app_timer_init();
        APP_ERROR_CHECK(err_code);

        err_code = app_timer_create(&m_restart_advertising_timer_id, APP_TIMER_MODE_SINGLE_SHOT, restart_advertising_callback);
        APP_ERROR_CHECK(err_code);

