jimmywong2003/nrf5-packet-error-rate-measurement-on-ble-connection/ble_app_image_transfer/main.c
        switch (pin_no)
        {
        case PHY_BUTTON:
                if (button_action == APP_BUTTON_PUSH && m_application_state.app_state == APP_STATE_IDLE)
                {
                        m_application_state.phy = (m_application_state.phy + 1) % APP_PHY_LIST_END;
                        advertising_init();
                        display_update();
                }
                break;

        case TX_POWER_BUTTON:
                if (button_action == APP_BUTTON_PUSH)
                {
                        m_application_state.tx_power = (m_application_state.tx_power + 1) % 3;
                        int8_t tx_power = (int8_t)(m_application_state.tx_power * 4);
                        if (m_application_state.app_state == APP_STATE_CONNECTED)
                        {
                                err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_CONN, m_conn_handle, tx_power);
                                APP_ERROR_CHECK(err_code);
                        }
                        else
                        {
                                err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, m_adv_handle, tx_power);
                                APP_ERROR_CHECK(err_code);
                        }
                        display_update();
                }
                break;

        case APP_STATE_BUTTON:
                if (button_action == APP_BUTTON_PUSH)
                {
                        if (m_application_state.app_state == APP_STATE_IDLE)
                        {
                                advertising_start();
                        }
                        else
                        {
                                ble_go_to_idle();
                        }
                }
                break;
        case LEDBUTTON_BUTTON:
                if (button_action == APP_BUTTON_PUSH)
                {
                }

                break;

        default:
                APP_ERROR_HANDLER(pin_no);
                break;
        }
}

/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
        ret_code_t err_code;

        //The array must be static because a pointer to it will be saved in the button handler module.
        static app_button_cfg_t buttons[] =
        {
                {PHY_BUTTON, false, BUTTON_PULL, button_event_handler},
                {TX_POWER_BUTTON, false, BUTTON_PULL, button_event_handler},
                {APP_STATE_BUTTON, false, BUTTON_PULL, button_event_handler},
                {LEDBUTTON_BUTTON, false, BUTTON_PULL, button_event_handler}
        };

        err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                                   BUTTON_DETECTION_DELAY);
        APP_ERROR_CHECK(err_code);
}

static void log_init(void)
{
        ret_code_t err_code = NRF_LOG_INIT(NULL);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
        ret_code_t err_code;
        err_code = nrf_pwr_mgmt_init();
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
        app_sched_execute();
        while (NRF_LOG_PROCESS())
                ;
        nrf_pwr_mgmt_run();
}

/**@brief Function for application main entry.
 */
int main(void)
{

        bool erase_bonds;
        ret_code_t err_code;

        /* enable instruction cache */
        NRF_NVMC->ICACHECNF = (NVMC_ICACHECNF_CACHEEN_Enabled << NVMC_ICACHECNF_CACHEEN_Pos) +
                              (NVMC_ICACHECNF_CACHEPROFEN_Disabled << NVMC_ICACHECNF_CACHEPROFEN_Pos);

        // Initialize.
        log_init();
        uart_init();
        leds_init();
        timers_init();
        buttons_init();
        power_management_init();
        ble_stack_init();
        scheduler_init();
        gap_params_init();
        gatt_init();
        services_init();
        advertising_init();
        conn_params_init();

        // Start execution.
        NRF_LOG_INFO("Packet Error Rate : Peripheral LBS + NUS.");

        app_display_init(&m_application_state);
        display_update();

        err_code = app_button_enable();
        APP_ERROR_CHECK(err_code);

        nrf_gpio_cfg_output(GPIO_SEND_COUNT_PIN);
        nrf_gpio_pin_clear(GPIO_SEND_COUNT_PIN);

        // Enter main loop.
        for (;;)
        {

                //                if (start_thoughput_test)
                //                {
                //                        test_thoughput();
                //                        start_thoughput_test = false;
                //                }
                idle_state_handle();
        }
}

/**
 * @}
 */
